tony-cloud/STM32_duino/STM32/boards.txt
NUCLEO_64.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
NUCLEO_64.menu.clock_source.bypass.build.f_cpu={build.f_cpuhse} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

NUCLEO_64.menu.clock_source.hsi=HSE_Disable(HSI)
NUCLEO_64.menu.clock_source.hsi.build.f_cpu={build.f_cpuhsi} -DUSE_HSI

NUCLEO_64.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
NUCLEO_64.menu.clock_source.hse8m.build.f_cpu={build.f_cpuhse} -DUSE_HSE -DHSE_VALUE=8000000


NUCLEO_64.menu.upload_method.MassStorageMethod=Mass Storage
NUCLEO_64.menu.upload_method.MassStorageMethod.upload.protocol=
NUCLEO_64.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

NUCLEO_64.menu.upload_method.STLinkMethod=STLink
NUCLEO_64.menu.upload_method.STLinkMethod.upload.protocol=STLink
NUCLEO_64.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

#################################### Nucleo-144 ############################################
# NUCLEO 144 board

NUCLEO_144.name=Nucleo-144
NUCLEO_144.vid.0=0x0483
NUCLEO_144.pid.0=0x374B

NUCLEO_144.build.core=arduino
NUCLEO_144.build.board=NUCLEO_144
NUCLEO_144.upload.tool=nucleoFlasher

NUCLEO_144.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3

NUCLEO_144.menu.subboard.Nucleo_F207ZG=Nucleo-F207ZG(120M)
NUCLEO_144.menu.subboard.Nucleo_F207ZG.upload.maximum_size=1048576
NUCLEO_144.menu.subboard.Nucleo_F207ZG.upload.maximum_data_size=131072
NUCLEO_144.menu.subboard.Nucleo_F207ZG.build.mcu=cortex-m3
NUCLEO_144.menu.subboard.Nucleo_F207ZG.build.series=STM32F2
NUCLEO_144.menu.subboard.Nucleo_F207ZG.build.variant=NUCLEO_F207ZG
NUCLEO_144.menu.subboard.Nucleo_F207ZG.build.board=NUCLEO_F207ZG
NUCLEO_144.menu.subboard.Nucleo_F207ZG.build.extra_flags=-DSTM32F207ZG
NUCLEO_144.menu.subboard.Nucleo_F207ZG.massstorage_drive=NODE_F207ZG
NUCLEO_144.menu.subboard.Nucleo_F207ZG.build.f_cpupre=120000000L

NUCLEO_144.menu.subboard.Nucleo_F767ZI=Nucleo-F767ZI(216M)
NUCLEO_144.menu.subboard.Nucleo_F767ZI.upload.maximum_size=2097152
NUCLEO_144.menu.subboard.Nucleo_F767ZI.upload.maximum_data_size=524288
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.series=STM32F7
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.variant=NUCLEO_F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.board=NUCLEO_F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.extra_flags=-DSTM32F767ZI
NUCLEO_144.menu.subboard.Nucleo_F767ZI.massstorage_drive=EVAL-FUCKST
NUCLEO_144.menu.subboard.Nucleo_F767ZI.build.f_cpupre=216000000L

NUCLEO_144.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
NUCLEO_144.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

NUCLEO_144.menu.clock_source.hsi=HSE_Disable(HSI)
NUCLEO_144.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

NUCLEO_144.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
NUCLEO_144.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

NUCLEO_144.menu.upload_method.MassStorageMethod=Mass Storage
NUCLEO_144.menu.upload_method.MassStorageMethod.upload.protocol=
NUCLEO_144.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

NUCLEO_144.menu.upload_method.STLinkMethod=STLink
NUCLEO_144.menu.upload_method.STLinkMethod.upload.protocol=STLink
NUCLEO_144.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

##################################### Discovery L053C8 ###########################################
# Discovery L053C8 board(32M)

DISCOVERY_L053C8.name=Discovery L053C8

DISCOVERY_L053C8.upload.maximum_size=65536
DISCOVERY_L053C8.upload.maximum_data_size=8192

DISCOVERY_L053C8.build.core=arduino
DISCOVERY_L053C8.build.board=DISCOVERY_L053C8

DISCOVERY_L053C8.build.mcu=cortex-m0
DISCOVERY_L053C8.build.series=STM32L0
DISCOVERY_L053C8.build.variant=DISCOVERY_L053C8
DISCOVERY_L053C8.build.extra_flags=-DSTM32L053C8
DISCOVERY_L053C8.build.f_cpupre=32000000L

DISCOVERY_L053C8.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_L053C8.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_L053C8.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_L053C8.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_L053C8.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_L053C8.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_L053C8.menu.upload_method.STLinkMethod=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.tool=stlink_upload


DISCOVERY_L053C8.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

DISCOVERY_L053C8.menu.usb.Disabled=Disabled USB
DISCOVERY_L053C8.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
DISCOVERY_L053C8.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_L053C8.menu.usb.SerialMSC=Mass storage
DISCOVERY_L053C8.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

DISCOVERY_L053C8.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/10]
DISCOVERY_L053C8.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_L053C8.menu.serial.SerialUSB=SerialUSB (USB connector)
DISCOVERY_L053C8.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

##################################### Discovery L152RC ###########################################
# Discovery L152RC board(32M)

DISCOVERY_L152R.name=Discovery L152RC


DISCOVERY_L152R.build.core=arduino
DISCOVERY_L152R.build.board=DISCOVERY_L152RC

DISCOVERY_L152R.build.mcu=cortex-m3
DISCOVERY_L152R.build.series=STM32L1

DISCOVERY_L152R.menu.subboard.L152RB=L152RB
DISCOVERY_L152R.menu.subboard.L152RB.upload.maximum_size=131072
DISCOVERY_L152R.menu.subboard.L152RB.upload.maximum_data_size=16384
DISCOVERY_L152R.menu.subboard.L152RB.build.variant=DISCOVERY_L152RC
DISCOVERY_L152R.menu.subboard.L152RB.build.extra_flags=-DSTM32L152RB
DISCOVERY_L152R.menu.subboard.L152RB.build.ldscript=l152rb.ld

DISCOVERY_L152R.menu.subboard.L152RC=L152RC
DISCOVERY_L152R.menu.subboard.L152RC.upload.maximum_size=262144
DISCOVERY_L152R.menu.subboard.L152RC.upload.maximum_data_size=32768
DISCOVERY_L152R.menu.subboard.L152RC.build.variant=DISCOVERY_L152RC
DISCOVERY_L152R.menu.subboard.L152RC.build.extra_flags=-DSTM32L152RC
DISCOVERY_L152R.menu.subboard.L152RC.build.ldscript=l152rc.ld

