tony-cloud/STM32_duino/STM32/boards.txt
DISCOVERY_L152R.build.f_cpupre=32000000L

DISCOVERY_L152R.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_L152R.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_L152R.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_L152R.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_L152R.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_L152R.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_L152R.menu.upload_method.STLinkMethod=STLink
DISCOVERY_L152R.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_L152R.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_L152R.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_L152R.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_L152R.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_L152R.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

DISCOVERY_L152R.menu.usb.Disabled=Disabled USB
DISCOVERY_L152R.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
DISCOVERY_L152R.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_L152R.menu.usb.SerialMSC=Mass storage
DISCOVERY_L152R.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_L152R.menu.usb.Composite=Composite[CDC+MSC]
DISCOVERY_L152R.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

DISCOVERY_L152R.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/10]
DISCOVERY_L152R.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_L152R.menu.serial.SerialUSB=SerialUSB (USB connector)
DISCOVERY_L152R.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

####################################### Discovery F303VC #########################################
# Discovery F303VC board

DISCOVERY_F303VC.name=Discovery F303VC(72M)

DISCOVERY_F303VC.upload.maximum_size=524288
DISCOVERY_F303VC.upload.maximum_data_size=40960

DISCOVERY_F303VC.build.core=arduino
DISCOVERY_F303VC.build.board=DISCOVERY_F303VC

DISCOVERY_F303VC.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F303VC.build.series=STM32F3
DISCOVERY_F303VC.build.variant=DISCOVERY_F303VC
DISCOVERY_F303VC.build.extra_flags=-DSTM32F303VC
DISCOVERY_F303VC.build.f_cpupre=72000000L

DISCOVERY_F303VC.menu.subboard.F303VC=Discovery F303VC

DISCOVERY_F303VC.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_F303VC.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_F303VC.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_F303VC.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_F303VC.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_F303VC.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_F303VC.upload.protocol=STLink
DISCOVERY_F303VC.upload.tool=stlink_upload

DISCOVERY_F303VC.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART2

#DISCOVERY_F303VC.menu.usb.Disabled=Disabled USB
#DISCOVERY_F303VC.menu.usb.SerialUSB=Serial [Virtual COM port]
#DISCOVERY_F303VC.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
#DISCOVERY_F303VC.menu.usb.SerialMSC=Mass storage
#DISCOVERY_F303VC.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

#DISCOVERY_F303VC.menu.serial.SerialUSB=SerialUSB
#DISCOVERY_F303VC.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#DISCOVERY_F303VC.menu.serial.SerialUART2=SerialUART2 [PA2/PA3]
#DISCOVERY_F303VC.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2

####################################### Discovery F407VG #########################################
# Discovery F407VG board

DISCOVERY_F407VG.name=Discovery F407VG(168M)

DISCOVERY_F407VG.upload.maximum_size=1048576
DISCOVERY_F407VG.upload.maximum_data_size=131072

DISCOVERY_F407VG.build.core=arduino
DISCOVERY_F407VG.build.board=DISCOVERY_F407VG

DISCOVERY_F407VG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F407VG.build.series=STM32F4
DISCOVERY_F407VG.build.variant=DISCOVERY_F407VG
DISCOVERY_F407VG.build.extra_flags=-DSTM32F407VG
DISCOVERY_F407VG.build.f_cpupre=168000000L

DISCOVERY_F407VG.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_F407VG.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_F407VG.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_F407VG.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_F407VG.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_F407VG.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_F407VG.menu.subboard.F407VG=Discovery F407VG

DISCOVERY_F407VG.menu.extern_lib.NONE = NONE
DISCOVERY_F407VG.menu.extern_lib.STemWin =STemWin
DISCOVERY_F407VG.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
DISCOVERY_F407VG.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
DISCOVERY_F407VG.menu.extern_lib.STemWinOS =STemWin_OS
DISCOVERY_F407VG.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
DISCOVERY_F407VG.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

DISCOVERY_F407VG.upload.protocol=STLink
DISCOVERY_F407VG.upload.tool=stlink_upload

DISCOVERY_F407VG.menu.usb.Disabled=Disabled USB
DISCOVERY_F407VG.menu.usb.SerialUSB=Serial [Virtual COM port]
DISCOVERY_F407VG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F407VG.menu.usb.SerialMSC=Mass storage
DISCOVERY_F407VG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

DISCOVERY_F407VG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F407VG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
DISCOVERY_F407VG.menu.serial.SerialUART2=SerialUART2 [PA2/PA3]
DISCOVERY_F407VG.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2

