tony-cloud/STM32_duino/STM32/boards.txt
F103V.menu.subboard.F103VC=GENERIC_F103VC[CH430]
F103V.menu.subboard.F103VC.upload.maximum_size=262144
F103V.menu.subboard.F103VC.upload.maximum_data_size=49152
F103V.menu.subboard.F103VC.upload.device=STM32F103VC
F103V.menu.subboard.F103VC.build.extra_flags0=-DSTM32F103VC
F103V.menu.subboard.F103VC.build.variant=F103V
F103V.menu.subboard.F103VC.build.board=GENERIC_F103VC
F103V.menu.subboard.F103VC.build.ldscript=f103xC.ld
F103V.menu.subboard.F103VC.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VC.upload.protocol=maple_serial
F103V.menu.subboard.F103VC.upload.tool=serial_upload
F103V.menu.subboard.F103VC.upload.altID=CH340
F103V.menu.subboard.F103VC.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VE1=GENERIC_F103VE[CH430]
F103V.menu.subboard.F103VE1.upload.maximum_size=524288
F103V.menu.subboard.F103VE1.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE1.upload.device=STM32F103VE
F103V.menu.subboard.F103VE1.build.extra_flags0=-DSTM32F103VE
F103V.menu.subboard.F103VE1.build.variant=F103V
F103V.menu.subboard.F103VE1.build.board=GENERIC_F103VE
F103V.menu.subboard.F103VE1.build.ldscript=f103xE.ld
F103V.menu.subboard.F103VE1.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE1.upload.protocol=maple_serial
F103V.menu.subboard.F103VE1.upload.tool=serial_upload
F103V.menu.subboard.F103VE1.upload.altID=CH340
F103V.menu.subboard.F103VE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VF=GENERIC_F103VF[CH340]
F103V.menu.subboard.F103VF.upload.maximum_size=786432
F103V.menu.subboard.F103VF.upload.maximum_data_size=98304
F103V.menu.subboard.F103VF.upload.device=STM32F103VF
F103V.menu.subboard.F103VF.build.extra_flags0=-DSTM32F103VF
F103V.menu.subboard.F103VF.build.variant=F103V
F103V.menu.subboard.F103VF.build.board=GENERIC_F103VF
F103V.menu.subboard.F103VF.build.ldscript=f103xF.ld
F103V.menu.subboard.F103VF.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VF.upload.protocol=maple_serial
F103V.menu.subboard.F103VF.upload.tool=serial_upload
F103V.menu.subboard.F103VF.upload.altID=CH340
F103V.menu.subboard.F103VF.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VG=GENERIC_F103VG[CH340]
F103V.menu.subboard.F103VG.upload.maximum_size=1048576
F103V.menu.subboard.F103VG.upload.maximum_data_size=98304
F103V.menu.subboard.F103VG.upload.device=STM32F103VG
F103V.menu.subboard.F103VG.build.extra_flags0=-DSTM32F103VG
F103V.menu.subboard.F103VG.build.variant=F103V
F103V.menu.subboard.F103VG.build.board=GENERIC_F103VG
F103V.menu.subboard.F103VG.build.ldscript=f103xG.ld
F103V.menu.subboard.F103VG.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VG.upload.protocol=maple_serial
F103V.menu.subboard.F103VG.upload.tool=serial_upload
F103V.menu.subboard.F103VG.upload.altID=CH340
F103V.menu.subboard.F103VG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.startadr.default=flash(default)
F103V.menu.startadr.default.build.extra_flags={build.extra_flags0}

F103V.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader)
F103V.menu.startadr.R20000000.upload.maximum_size=45056
F103V.menu.startadr.R20000000.upload.maximum_data_size=20480
F103V.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103V.menu.startadr.R20000000.build.ldscript=f103xE_RAM0.ld
F103V.menu.startadr.R20000000.upload.uploadadr=0x20000000
F103V.menu.startadr.R20000000.upload.vect=0x20000000

F103V.menu.extern_lib.NONE = NONE
F103V.menu.extern_lib.STemWin =STemWin
F103V.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F103V.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F103V.menu.extern_lib.STemWinOS =STemWin_OS
F103V.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F103V.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#---------------------------- UPLOAD METHODS ---------------------------
F103V.menu.upload_method.default=Upload default

F103V.menu.upload_method.STLinkMethod=STLink
F103V.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103V.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103V.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.jLinkMethod=JLink
F103V.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103V.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103V.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103V.menu.upload_method.MassStorageMethod.upload.protocol=
F103V.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103V.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F103V.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod.upload.altID=UNUSED
F103V.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103V.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod1.upload.altID=PL2303
F103V.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103V.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod2.upload.altID=CH340
F103V.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103V.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103V.menu.upload_method.BMPMethod.upload.tool=bmp_upload

