tony-cloud/STM32_duino/STM32/boards.txt
F401S.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F401S.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F401S.menu.upload_method.serialMethod1.upload.tool=serial_upload
F401S.menu.upload_method.serialMethod1.upload.altID=PL2303
F401S.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F401S.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F401S.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F401S.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F401S.menu.usb.Disabled=Disabled USB
F401S.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F401S.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F401S.menu.usb.SerialMSC=Mass storage
F401S.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F401S.menu.usb.Composite=Composite[CDC+MSC]
F401S.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F401S.menu.serial.SerialUART1=SerialUART1
F401S.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F401S.menu.serial.SerialUSB=SerialUSB
F401S.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
F401S.menu.serial.Automatic=Automatically selected based on upload method

################################### F407V/Z/I #############################################
F407S.name=F407S

F407S.vid.0=0x1a86
F407S.pid.0=0x7523

F407S.vid.1=0x1366
F407S.pid.1=0x0105

F407S.serial.disableDTR=true
F407S.serial.disableRTS=true
F407S.upload.uploadadr=0x08000000
F407S.upload.vect=0x08000000

F407S.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
F407S.build.core=arduino
F407S.build.board=BLACK_F407VE
F407S.build.series=STM32F4
F407S.build.f_cpu=168000000L
F407S.build.ldscript=ldscript.ld

F407S.menu.subboard.BLACK_407V=BLACK_F407VE[YL136 JLink]
F407S.menu.subboard.BLACK_407V.upload.maximum_size=524288
F407S.menu.subboard.BLACK_407V.upload.maximum_data_size=131072
F407S.menu.subboard.BLACK_407V.build.variant=BLACK_F407VE
F407S.menu.subboard.BLACK_407V.build.board=BLACK_F407VE
F407S.menu.subboard.BLACK_407V.build.extra_flags0=-DSTM32F407VE -DHSE_VALUE=8000000
F407S.menu.subboard.BLACK_407V.massstorage_drive=NUCLEO
F407S.menu.subboard.BLACK_407V.upload.device=STM32F407VE
#default upload method
F407S.menu.subboard.BLACK_407V.upload.tool=jlink_upload
F407S.menu.subboard.BLACK_407V.upload.protocol=jlink
F407S.menu.subboard.BLACK_407V.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407S.menu.subboard.V11_F407V=F407VE_V11[BLUE  CH340]
F407S.menu.subboard.V11_F407V.upload.maximum_size=524288
F407S.menu.subboard.V11_F407V.upload.maximum_data_size=131072
F407S.menu.subboard.V11_F407V.build.variant=F407VE_V11
F407S.menu.subboard.V11_F407V.build.board=V11VET6
F407S.menu.subboard.V11_F407V.build.extra_flags0=-DSTM32F407VE -DHSE_VALUE=8000000
F407S.menu.subboard.V11_F407V.upload.device=STM32F407VE
#default upload method
F407S.menu.subboard.V11_F407V.upload.protocol=maple_serial
F407S.menu.subboard.V11_F407V.upload.tool=serial_upload
F407S.menu.subboard.V11_F407V.upload.altID=CH340
F407S.menu.subboard.V11_F407V.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407S.menu.subboard.ArmFly_F4=ArmFly_F407ZG[MassStorage]
F407S.menu.subboard.ArmFly_F4.upload.maximum_size=1232896
F407S.menu.subboard.ArmFly_F4.upload.maximum_data_size=131072
F407S.menu.subboard.ArmFly_F4.build.variant=ARMFLY_F407ZG
F407S.menu.subboard.ArmFly_F4.build.board=ARMFLY_F4
F407S.menu.subboard.ArmFly_F4.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407S.menu.subboard.ArmFly_F4.massstorage_drive=NUCLEO
F407S.menu.subboard.ArmFly_F4.upload.device=STM32F407ZG
#default upload method
F407S.menu.subboard.ArmFly_F4.upload.protocol=
F407S.menu.subboard.ArmFly_F4.upload.tool=nucleoFlasher
F407S.menu.subboard.ArmFly_F4.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407S.menu.subboard.IMT407GV21=ILLUMINATI_F407ZG[JLink SerialUART3]
F407S.menu.subboard.IMT407GV21.upload.maximum_size=1232896
F407S.menu.subboard.IMT407GV21.upload.maximum_data_size=131072
F407S.menu.subboard.IMT407GV21.build.variant=ILLUMINATI_F407ZG
F407S.menu.subboard.IMT407GV21.build.board=IMT407GV21
F407S.menu.subboard.IMT407GV21.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407S.menu.subboard.IMT407GV21.massstorage_drive=NUCLEO
F407S.menu.subboard.IMT407GV21.upload.device=STM32F407ZG
#default upload method
F407S.menu.subboard.IMT407GV21.upload.tool=jlink_upload
F407S.menu.subboard.IMT407GV21.upload.protocol=jlink
F407S.menu.subboard.IMT407GV21.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3

F407S.menu.subboard.IGT6_CORE=F407IG_CORE[GREEN MassStorage]
F407S.menu.subboard.IGT6_CORE.upload.maximum_size=1232896
F407S.menu.subboard.IGT6_CORE.upload.maximum_data_size=131072
F407S.menu.subboard.IGT6_CORE.build.variant=F407IG_CORE
F407S.menu.subboard.IGT6_CORE.build.board=IGT6CORE
F407S.menu.subboard.IGT6_CORE.build.extra_flags0=-DSTM32F407IG -DHSE_VALUE=8000000
F407S.menu.subboard.IGT6_CORE.massstorage_drive=NUCLEO
F407S.menu.subboard.IGT6_CORE.upload.device=STM32F407IG
#default upload method
F407S.menu.subboard.IGT6_CORE.upload.protocol=
F407S.menu.subboard.IGT6_CORE.upload.tool=nucleoFlasher
F407S.menu.subboard.IGT6_CORE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407S.menu.subboard.GENERIC_F407V=GENERIC_F407VE[STLink]
F407S.menu.subboard.GENERIC_F407V.upload.maximum_size=524288
F407S.menu.subboard.GENERIC_F407V.upload.maximum_data_size=131072
F407S.menu.subboard.GENERIC_F407V.build.variant=BLUE_F407VE
F407S.menu.subboard.GENERIC_F407V.build.board=GENERIC_F407VE
F407S.menu.subboard.GENERIC_F407V.build.extra_flags0=-DSTM32F407VE -DHSE_VALUE=8000000
F407S.menu.subboard.GENERIC_F407V.upload.device=STM32F407VE
F407S.menu.subboard.GENERIC_F407V.upload.protocol=STLink
F407S.menu.subboard.GENERIC_F407V.upload.tool=stlink_upload
F407S.menu.subboard.GENERIC_F407V.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407S.menu.subboard.BLACK_F407ZE=GENERIC_F407ZE[STLink]
F407S.menu.subboard.BLACK_F407ZE.upload.maximum_size=1232896
F407S.menu.subboard.BLACK_F407ZE.upload.maximum_data_size=131072
F407S.menu.subboard.BLACK_F407ZE.build.variant=BLACK_F407ZE
F407S.menu.subboard.BLACK_F407ZE.build.board=GENERIC_F407ZE
F407S.menu.subboard.BLACK_F407ZE.build.extra_flags0=-DSTM32F407ZE -DHSE_VALUE=8000000
F407S.menu.subboard.BLACK_F407ZE.upload.device=STM32F407ZE
F407S.menu.subboard.BLACK_F407ZE.upload.protocol=STLink
F407S.menu.subboard.BLACK_F407ZE.upload.tool=stlink_upload
F407S.menu.subboard.BLACK_F407ZE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407S.menu.subboard.BLACK_F407ZG=GENERIC_F407ZG[ STLink]
F407S.menu.subboard.BLACK_F407ZG.upload.maximum_size=1232896
F407S.menu.subboard.BLACK_F407ZG.upload.maximum_data_size=131072
F407S.menu.subboard.BLACK_F407ZG.build.variant=BLACK_F407ZG
F407S.menu.subboard.BLACK_F407ZG.build.board=GENERIC_F407ZG
F407S.menu.subboard.BLACK_F407ZG.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407S.menu.subboard.BLACK_F407ZG.upload.device=STM32F407ZG
F407S.menu.subboard.BLACK_F407ZG.upload.protocol=STLink
F407S.menu.subboard.BLACK_F407ZG.upload.tool=stlink_upload
F407S.menu.subboard.BLACK_F407ZG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB


F407S.menu.startadr.default=flash(default)
F407S.menu.startadr.default.build.extra_flags={build.extra_flags0}

F407S.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader)
F407S.menu.startadr.R20000000.upload.maximum_size=98304
F407S.menu.startadr.R20000000.upload.maximum_data_size=32768
F407S.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F407S.menu.startadr.R20000000.build.ldscript=f407xE_RAM0.ld
F407S.menu.startadr.R20000000.upload.uploadadr=0x20000000
F407S.menu.startadr.R20000000.upload.vect=0x20000000

F407S.menu.extern_lib.NONE = NONE
F407S.menu.extern_lib.STemWin =STemWin
F407S.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
F407S.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F407S.menu.extern_lib.STemWinOS =STemWin_OS
F407S.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
F407S.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

F407S.menu.upload_method.default=Upload default

F407S.menu.upload_method.jLinkMethod=JLink
F407S.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F407S.menu.upload_method.jLinkMethod.upload.protocol=jlink
F407S.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407S.menu.upload_method.STLinkMethod=STLink
F407S.menu.upload_method.STLinkMethod.upload.protocol=STLink
F407S.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F407S.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407S.menu.upload_method.MassStorageMethod=MassStorage [STLINK V2.1]
F407S.menu.upload_method.MassStorageMethod.upload.protocol=
F407S.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F407S.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F407S.menu.upload_method.serialMethod.upload.protocol=maple_serial
F407S.menu.upload_method.serialMethod.upload.tool=serial_upload
F407S.menu.upload_method.serialMethod.upload.altID=UNUSED
F407S.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407S.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F407S.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F407S.menu.upload_method.serialMethod2.upload.tool=serial_upload
F407S.menu.upload_method.serialMethod2.upload.altID=CH340
F407S.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407S.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F407S.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F407S.menu.upload_method.serialMethod1.upload.tool=serial_upload
F407S.menu.upload_method.serialMethod1.upload.altID=PL2303
F407S.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407S.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F407S.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F407S.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F407S.menu.usb.Disabled=Disabled USB
F407S.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F407S.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F407S.menu.usb.SerialMSC=Mass storage
F407S.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F407S.menu.usb.Composite=Composite[CDC+MSC]
F407S.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F407S.menu.serial.SerialUART1=SerialUART1
F407S.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F407S.menu.serial.SerialUART2=SerialUART2
F407S.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F407S.menu.serial.SerialUART3=SerialUART3
F407S.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F407S.menu.serial.SerialUSB=SerialUSB
F407S.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
F407S.menu.serial.Automatic=Automatically selected based on upload method

