tony-cloud/STM32_duino/STM32/boards.txt
###################################### F746S ##########################################
# Discovery F746IG board
F746S.name=F746S
F746S.vid.1=0x10C4
F746S.pid.1=0xEA60

F746S.serial.disableDTR=true
F746S.serial.disableRTS=true
F746S.upload.maximum_size=1048576
F746S.upload.maximum_data_size=327680
F746S.upload.uploadadr=0x08000000
F746S.upload.vect=0x08000000

F746S.build.core=arduino
F746S.build.board=WAVESHARE_F746IG

F746S.build.mcu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-sp-d16 
F746S.build.series=STM32F7
F746S.build.variant=WAVESHARE_F746IG
F746S.build.extra_flags=-DSTM32F746IG -DDATA_IN_ExtSDRAM -DHSE_VALUE=((uint32_t)8000000)
F746S.build.f_cpu=216000000L

F746S.menu.subboard.F746IG=WaveShare F746IG(1024K+320K)

F746S.menu.startadr.F08000000=flash (default)
F746S.menu.startadr.F08000000.build.extra_flags={build.extra_flags0}

F746S.menu.startadr.R20000000=Sram 0:0x20000000(196K+128K BOOT=11 ST/Jlink uploader)
F746S.menu.startadr.R20000000.upload.maximum_size=200704
F746S.menu.startadr.R20000000.upload.maximum_data_size=131072
F746S.menu.startadr.R20000000.build.extra_flags=-DSTM32F746IG -DDATA_IN_ExtSDRAM -DHSE_VALUE=((uint32_t)8000000) -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F746S.menu.startadr.R20000000.build.ldscript=f746xG_RAM0.ld
F746S.menu.startadr.R20000000.upload.uploadadr=0x20000000
F746S.menu.startadr.R20000000.upload.vect=0x20000000

F746S.menu.usb.Disabled=Disabled USB
F746S.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F746S.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F746S.menu.usb.SerialMSC=Mass storage
F746S.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F746S.menu.usb.Composite=Composite[CDC+MSC]
F746S.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F746S.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/PA10]
F746S.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F746S.menu.serial.SerialUSB=SerialUSB
F746S.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

F746S.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F746S.menu.upload_method.serialMethod.upload.protocol=maple_serial
F746S.menu.upload_method.serialMethod.upload.tool=serial_upload
F746S.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F746S.menu.upload_method.STLinkMethod=STLink
F746S.menu.upload_method.STLinkMethod.upload.protocol=STLink
F746S.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

F746S.menu.upload_method.jLinkMethod=JLink
F746S.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F746S.menu.upload_method.jLinkMethod.upload.protocol=jlink
F746S.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F746S.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F746S.menu.upload_method.MassStorageMethod.upload.protocol=
F746S.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
F746S.menu.upload_method.MassStorageMethod.massstorage_drive=NUCLEO

###################################### end ##########################################
